
# Quelques m√©thodes utiles en pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = { 'Nom': ['Christophe', 'Clara','Lina', 'Amine', 'Amandine'],
        'Maths': [13,10,10,11,9],
        'Physique': [13,13,12,11,12],
        'Informatique': [18,12,10,18,9],
        'Anglais': [10,14,7,13.5,13.5]
    }

In [3]:
notes = pd.DataFrame(data)

In [4]:
notes

          Nom  Maths  Physique  Informatique  Anglais
0  Christophe     13        13            18     10.0
1       Clara     10        13            12     14.0
2        Lina     10        12            10      7.0
3       Amine     11        11            18     13.5
4    Amandine      9        12             9     13.5

In [5]:
notes['Maths'].unique()

array([13, 10, 11,  9], dtype=int64)

In [6]:
notes['Informatique'].unique()

array([18, 12, 10,  9], dtype=int64)

In [7]:
notes['Maths'].nunique()

4

In [8]:
def carre(x):
    return x*x

In [9]:
carre(3)

9

In [10]:
notes['Maths'].apply(carre)

0    169
1    100
2    100
3    121
4     81
Name: Maths, dtype: int64

In [11]:
notes.sort_values('Maths')

          Nom  Maths  Physique  Informatique  Anglais
4    Amandine      9        12             9     13.5
1       Clara     10        13            12     14.0
2        Lina     10        12            10      7.0
3       Amine     11        11            18     13.5
0  Christophe     13        13            18     10.0

In [12]:
notes.sort_values('Physique')

          Nom  Maths  Physique  Informatique  Anglais
3       Amine     11        11            18     13.5
2        Lina     10        12            10      7.0
4    Amandine      9        12             9     13.5
0  Christophe     13        13            18     10.0
1       Clara     10        13            12     14.0

In [13]:
notes.isnull()

     Nom  Maths  Physique  Informatique  Anglais
0  False  False     False         False    False
1  False  False     False         False    False
2  False  False     False         False    False
3  False  False     False         False    False
4  False  False     False         False    False

In [14]:
notes

          Nom  Maths  Physique  Informatique  Anglais
0  Christophe     13        13            18     10.0
1       Clara     10        13            12     14.0
2        Lina     10        12            10      7.0
3       Amine     11        11            18     13.5
4    Amandine      9        12             9     13.5

In [15]:
notes.set_index('Nom', inplace = True)

In [16]:
notes

            Maths  Physique  Informatique  Anglais
Nom
Christophe     13        13            18     10.0
Clara          10        13            12     14.0
Lina           10        12            10      7.0
Amine          11        11            18     13.5
Amandine        9        12             9     13.5

In [17]:
notes['Maths'].idxmax()

'Christophe'

In [18]:
notes['Anglais'].idxmax()

'Clara'

In [19]:
notes['Maths'].idxmin()

'Amandine'

In [20]:
notes['Maths'].argmax()

0

In [21]:
notes['Informatique'].argmin()

4